<template>
    <Navbar></Navbar>
    <div class="policy">
        <h2>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h2>
        <p class="policy__description">
            Мы признаем важность конфиденциальности информации. 
            В этом документе описывается, какую личную информацию мы получаем и собираем, 
            когда Вы пользуетесь сайтом . Мы надеемся, что эти сведения помогут 
            Вам принимать осознанные решения в отношении предоставляемой нам личной информации.
        </p>

        <div v-for="el in staticData" v-bind:key="el.id" class="policy__elem">
            <div>
                <h3>{{ el.title }}</h3>
            </div>
            <p>{{ el.description }}</p>
        </div>
    </div>
</template>

<script>
import Navbar from '@/components/Navbar'

export default {
    components: {
        Navbar
    },
    data() {
        return {
            staticData: [
                {
                    id: 1,
                    title: 'Телефонный номер, электронная почта и имя',
                    description: `
                        Номер телефона, почта и имя, указываемые Вами при отправке заявки и заказе обратного звонка,
                        не показываются другим посетителям сайта. Мы можем сохранять полученные данные и другие письма,
                        отправленные Вами, чтобы обрабатывать Ваши заявки, отвечать на запросы клиентов и совершенствовать
                        уровень обслуживания.
                    `
                },
                {
                    id: 2,
                    title: 'Условия обработки и её передачи третьим лицам',
                    description: `
                        Ваши Имя и Номер телефона никогда и ни при каких условиях не будут переданы третьим лицам,
                        исключая случаи, которые связаны с исполнением законодательства Российской Федерации.
                    `
                },
                {
                    id: 3,
                    title: 'Протоколирование',
                    description: `
                        При каждом посещении сайта наши серверы автоматически записывают информацию, которую Ваш
                        браузер передает при посещении веб-страниц. Как правило, эта информация включает запрашиваемую
                        веб-страницу, IP-адрес компьютера, тип браузера, языковые настройки браузера, дату и время запроса,
                        а также один или несколько файлов cookie, которые позволяют точно идентифицировать Ваш браузер.
                    `
                },
                {
                    id: 4,
                    title: 'Куки (cookie)',
                    description: `
                        На сайте используются куки (Cookies), происходит сбор данных о посетителях с помощью сервисов
                        Яндекс Метрика и Google Analitycs. Эти данные служат для сбора информации о действиях посетителей
                        на сайте, для улучшения качества его содержания, возможностей и удобства использования. В любое
                        время Вы можете изменить параметры в настройках Вашего браузера таким образом, чтобы браузер
                        перестал передавать (сохранять) все файлы cookie, а также оповещал об их отправке. При этом
                        следует учесть, что в этом случае некоторые сервисы и функции могут перестать работать.
                    `
                },
                {
                    id: 5,
                    title: 'Изменение политики конфиденциальности',
                    description: `
                        На этой странице Вы сможете узнать о любых изменениях данной политики конфиденциальности.
                        В особых случаях Вам будет выслана информация на Ваш телефон.
                    `
                },
                {
                    id: 6,
                    title: 'Затраты на доступ ',
                    description: `
                        Вы должны обеспечить за свой счет оборудование и подключение к Интернет, необходимые Вам для
                        получения доступа к Сайту и его использования. Вы несете единоличную ответственность за любые
                        затраты на доступ к Сайту через беспроводную связь или иные.
                    `
                }
            ]
        }
    }
}
</script>

<style>
    .policy {
        margin: 0 10%;
        background-color: rgb(170, 171, 166);
    }

    .policy__elem {
        padding: 1rem 3rem;
        text-align: justify;

        display: flex;
        justify-content: center;
        flex-direction: column;
        align-items: center;
    }

    .policy__description {
        padding: 1rem 3rem;
        text-align: justify;
    }

    h2 {
        padding-top: 1rem;
    }
</style>